[
  {
    "path": "posts/2024-01-23-meds-students-winning-awards/",
    "title": "MEDS Students Winning Awards",
    "description": "We take great pride in announcing the recent accomplishments of numerous MEDS students who have been honored with awards.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2024-01-23",
    "categories": [],
    "contents": "\r\nGO BACK TO ALL POSTS\r\n✨Awards for MEDS Students✨\r\nIn a remarkable display of academic excellence, our distinguished MEDS graduate students have recently garnered a series of prestigious awards and scholarships. These accolades not only underscore their commitment to scholarly pursuits but also highlight their exceptional contributions to the academic community. Join us in celebrating the well-deserved recognition bestowed upon our accomplished MEDS graduate students, as they continue to exemplify the highest standards of achievement within our institution.\r\nBest regards,\r\nOkan Bulut\r\nAssociate Professor\r\nUniversity of Alberta\r\n\r\nSurina He (Doctoral Student)\r\nAlberta Innovates Graduate Student Scholarship 2023/2024\r\nProject title: Enhanced assessment of collaborative problem-solving ability using machine learning technique\r\n\r\nAlberta Graduate Excellence Scholarship 2023/2024\r\nProject title: Examining pre-school children’s problem-solving strategies using process data\r\n\r\nBin Tan (Doctoral Student)\r\nAlberta Graduate Excellence Scholarship 2023/2024\r\nProject title: Assessing the value of examinees’ response time profiles\r\n\r\nAshley Clelland (Doctoral Student)\r\nAccessible Teaching, Learning, and Assessment Systems (ATLAS) Fellowship 2023/2024\r\nProject title: A systematic review of online professional development in special education\r\n\r\nAugustine Botwe (Doctoral Student)\r\nGraduate Student Engagement Scholarship 2023/2024\r\nDoris Abroampah (MEd Student)\r\nGraduate Student Engagement Scholarship 2023/2024\r\n\r\n\r\n\r\n",
    "preview": "posts/2024-01-23-meds-students-winning-awards/nataliya.jpg",
    "last_modified": "2024-01-23T17:15:52-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-12-15-end-of-year-celebration/",
    "title": "End-of-Year Celebration",
    "description": "We celebrated the close of a remarkable Fall semester at the MEDS program. Our recent end-of-year gathering was a festive occasion where faculty members and graduate students came together to reflect on a myriad of achievements.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2023-12-15",
    "categories": [],
    "contents": "\r\nGO BACK TO ALL POSTS\r\n🍁A Festive End-of-Year Gathering🍁\r\nAs the Fall semester comes to a close, the Measurement, Evaluation, and Data Science (MEDS) program recently hosted a joyous end-of-year celebration that brought together graduate students and faculty members. The event was a testament to the hard work, dedication, and numerous achievements of the MEDS community over the past months.\r\nMEDS graduate students and faculty members at CRAMEA Year of Success for MEDS Students\r\nOne of the highlights of the celebration was reflecting on the impressive accomplishments of MEDS students. A notable achievement is the acceptance of a significant number of conference presentations for various conferences, with the pinnacle being the annual meeting of the National Council on Measurement in Education (NCME) scheduled to take place in Philadelphia, PA in April 2024. This accomplishment not only showcases the students’ commitment to advancing their field but also underscores the academic excellence fostered within the MEDS program.\r\nThe meeting was also a great opportunity for the Beijing Normal Cohort to share their first-term experiences at the University of Alberta. The cross-cultural exchange enriched the gathering, providing a unique perspective on the diverse learning environment at MEDS.\r\nCelebrating Excellence\r\nIn a moment of pride for the MEDS program, we extend heartfelt congratulations to two outstanding students, Bin Tan and Surina He, for receiving the Alberta Graduate Excellence Scholarship (AGES). This prestigious scholarship recognizes and rewards exceptional academic achievement in graduate studies in Alberta, including international students. Bin Tan and Surina He’s achievement is a testament to their dedication and scholarly contributions, making MEDS proud to have such accomplished individuals in the program.\r\nThe AGES serves as an incentive to attract the best and brightest minds, fostering a culture of excellence within the academic community. The fact that two international students from the MEDS program have been honored with this esteemed award further underscores the global impact and recognition of the program.\r\nWishing Everyone Happy Holidays\r\nAs we approach the holiday season, the MEDS program would like to extend warm wishes to all students and faculty members. May this festive season be filled with joy, relaxation, and moments of reflection on the accomplishments of the past year. We look forward to the opportunities and challenges the new year will bring and are excited to continue our journey of learning and discovery together.\r\nCheers to a successful year and a promising future for the Measurement, Evaluation, and Data Science program at the University of Alberta! Happy holidays to all!\r\nWarmest regards,\r\nOkan Bulut\r\nAssociate Professor\r\nUniversity of Alberta\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-12-15-end-of-year-celebration/fall2023_end_end_year.jpeg",
    "last_modified": "2023-12-15T09:58:42-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-10-06-welcome-to-fall-2023/",
    "title": "Welcome to Fall 2023",
    "description": "Welcoming MEDS students to the Fall semester with a special gathering at Rosso Pizzeria. With the changing colors of campus serving as a poignant backdrop, we share our excitement for the academic year ahead and offer our sincere wishes for the success of every student.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2023-10-06",
    "categories": [],
    "contents": "\r\nGO BACK TO ALL POSTS\r\n🍁📚 Welcome, Fall 2023 Students! 📚🍁\r\nAs the leaves outside begin their enchanting transformation, we are delighted to extend a warm and heartfelt welcome to each and every one of our students as they embark on their academic journey at the University of Alberta.\r\nThis Fall, our campus comes alive with the promise of new friendships, inspiring professors, and countless opportunities for personal and intellectual development. Together, we will explore uncharted territories of learning, delve into the depths of curiosity, and embrace the challenges that will shape your future.\r\nTo celebrate the beginning of this exciting semester, the Measurement, Evaluation, and Data Science (MEDS) program organized a delightful gathering for all graduate students at the charming Rosso Pizzeria. This was the perfect opportunity to bring our students together, relax after the first week of classes, and share some delicious food and laughter together.\r\nMEDS graduate students and Dr. Okan Bulut in front of the Education CentreOn behalf of the entire U of A family, we wish all students a spectacular academic year filled with achievements, unforgettable moments, and discoveries. Together, we’ll create a tapestry of memories that will color your life for years to come.\r\nHere’s to a successful and transformative academic year ahead! 🌟📖🎓\r\nWarmest regards,\r\nOkan Bulut\r\nAssociate Professor\r\nUniversity of Alberta\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-10-06-welcome-to-fall-2023/meds_photo_fall2023.jpg",
    "last_modified": "2023-10-06T16:21:11-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-06-22-congratulations-to-recent-meds-graduates/",
    "title": "Congratulations to Recent MEDS Graduates!",
    "description": "A hearty congratulations to our recent graduates for completing \ntheir PhD in the MEDS program. Check out the details here.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2023-06-22",
    "categories": [],
    "contents": "\r\nGO BACK TO ALL POSTS\r\nCongratulations to Recent MEDS Graduates!\r\nA hearty congratulations to our recent graduates for completing their Ph.D. in the MEDS program:\r\nDr. Seyma N. Yildirim-Erbasli (Assistant Professor at Concordia University of Edmonton)\r\nDr. Tahereh Firoozi (Senior Psychometrician at Alberta Education)\r\nDr. Yizhu Gao (Senior Data Analyst at Ministry of Children’s Services, Government of Alberta)\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-06-22-congratulations-to-recent-meds-graduates/graduate.jpg",
    "last_modified": "2023-06-22T13:12:55-06:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-06-22-welcome-to-the-new-meds-website/",
    "title": "Welcome to the New MEDS Website",
    "description": "Have you checked out our new website yet? We’re excited to announce \nthat the new MEDS website has been launched, built from the ground up \nwith a fresh look! Check out the details here.",
    "author": [
      {
        "name": "Okan Bulut",
        "url": "http://www.okanbulut.com/"
      }
    ],
    "date": "2023-06-22",
    "categories": [],
    "contents": "\r\nGO BACK TO ALL POSTS\r\nNew Website Announcement\r\nHave you checked out our new website yet?\r\nWe’re excited to announce that the new MEDS website has been launched, built from the ground up with a fresh look!\r\n\r\nhttps://sites.google.com/ualberta.ca/meds\r\n\r\nThe new website provides most recent information on the MEDS program, including our graduate courses, program-related news, and many resources for current and prospective students. Please check out our website for up-to-date information about MEDS.\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-06-22-welcome-to-the-new-meds-website/img1.png",
    "last_modified": "2023-06-22T13:13:20-06:00",
    "input_file": {},
    "preview_width": 1049,
    "preview_height": 720
  }
]
